### [ env/poc ] terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_role_assignment.aks-acr-rbac will be created
  + resource "azurerm_role_assignment" "aks-acr-rbac" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6ee38f36-246d-4257-9c52-66bc02f84a82"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.ContainerRegistry/registries/faspopocacr"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.aks-network-rbac will be created
  + resource "azurerm_role_assignment" "aks-network-rbac" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6ee38f36-246d-4257-9c52-66bc02f84a82"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/virtualNetworks/faspo-poc-vnet"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
